[
    {
        "course_id": "1",
        "course_name": "Introduction to HTML5",
        "category_id": "1",
        "category_name": "HTML 5",
        "price": "50",
        "details": "Thanks to a growing number of software programs, it seems as if anyone can make a webpage. But what if you actually want to understand how the page was created? There are great textbooks and online resources for learning web design, but most of those resources require some background knowledge. This course is designed to help the novice who wants to gain confidence and knowledge. We will explore the theory (what actually happens when you click on a link on a webpage?), the practical (what do I need to know to make my own page?), and the overlooked (I have a page, what do I do now?). Throughout the course there will be a strong emphasis on adhering to syntactic standards for validation and semantic standards to promote wide accessibility for users with disabilities.  The textbook we use is available online, “The Missing Link: An Introduction to Web Development and Programming” by Michael Mendez from www.opensuny.org. This course will appeal to a wide variety of people, but specifically those who would like a step-by-step description of the basics. There are no prerequisites for this course and it is assumed that students have no prior programming skills or IT experience. The course will culminate in a small final project that will require the completion of a very simple page with links and images. The focus of this course is on the basics, not appearance. You can see a sample final page at http://intro-webdesign.com/html5-plain.html. This is the first course in the Web Design For Everybody specialization. Subsequent courses focus on the marketable skills of styling the page with CSS3, adding interactivity with JavaScript and enhancing the styling with responsive design. You can see a sample site for the capstone course at http://intro-webdesign.com/",
        "thumbnail_img": "https://i.ibb.co/hfjZtXX/html-5.jpg",
        "full_img": "https://i.ibb.co/rsSc1bb/html-5.jpg",
        "instructor": {
            "name": "Abdullah Al Mahmud",
            "photo": "https://lh3.googleusercontent.com/a/ALm5wu3PlOmTT7FoB-ex8SUQ-itQ4OCDAA7g3t1dfy6f=s96-c-rg-br100"
        },
        "ratings": {
            "rating": "5.0",
            "rated": "1250"
        },
        "enrolled": "30"
    },
    {
        "course_id": "2",
        "course_name": "Introduction to CSS3",
        "category_id": "2",
        "category_name": "CSS 3",
        "price": "80",
        "details": "The web today is almost unrecognizable from the early days of white pages with lists of blue links.  Now, sites are designed with complex layouts, unique fonts, and customized color schemes.   This course will show you the basics of Cascading Style Sheets (CSS3).  The emphasis will be on learning how to write CSS rules, how to test code, and how to establish good programming habits. When done correctly, the styling of a webpage can take enhance your page.   When done incorrectly the result can be worse than no styling at all.    To ensure that your sites do not put up  barriers for people with cognitive and/or physical disabilities, you will learn how to evaluate pages using the standardized POUR accessibility guidelines.    Upon completion of the course, learners will be able to sketch a design for a given HTML page.  Using that design they will use CSS to implement the design by adding fonts, colors, and  layouts. This is the second course in the Web Design For Everybody specialization.   Subsequent courses focus on adding interaction with JavaScript and enhancing the styling with responsive design. It will be difficult to complete this course if you do not have access to a laptop or desktop computer for the homework.",
        "thumbnail_img": "https://i.ibb.co/MBnxqnh/css3.jpg",
        "full_img": "https://i.ibb.co/g4yLsy7/css3.jpg",
        "instructor": {
            "name": "Sahhin Reza",
            "photo": "https://media-exp2.licdn.com/dms/image/C5103AQGJae1wNbPh5w/profile-displayphoto-shrink_200_200/0/1547554246036?e=2147483647&v=beta&t=_AYbjqKoOg8EYREDkiisD3K6H7RmKRTQgUm63fWlAzk"
        },
        "ratings": {
            "rating": "4.9",
            "rated": "1050"
        },
        "enrolled": "25"
    },
    {
        "course_id": "3",
        "course_name": "Web UI Frameworks and Tools: Bootstrap 5",
        "category_id": "3",
        "category_name": "Bootstrap 5",
        "price": "120",
        "details": "This course will give you an overview of client-side web UI frameworks, in particular Bootstrap 5. You will learn about grids and responsive design, Bootstrap CSS and JavaScript components. You will learn about CSS preprocessors, Less and Sass. You will also learn the basics of Node.js and NPM and task runners like Grunt and Gulp. At the end of this course, you will be able to a)Set up, design and style a web page using Bootstrap 5 and its components, b) Create a responsive web page design, and c) Make use of web tools to setup and manage web sites. This course also includes an honors track that enables you to work on your own project developing a website using Bootstrap 5. Students enrolling in this course should have prior good working knowledge of HTML, CSS and JavaScript.",
        "thumbnail_img": "https://i.ibb.co/MBnxqnh/css3.jpg",
        "full_img": "https://i.ibb.co/g4yLsy7/css3.jpg",
        "instructor": {
            "name": "Jogesh K. Muppala",
            "photo": "https://www.cse.ust.hk/~muppala/img/muppala.jpg"
        },
        "ratings": {
            "rating": "4.9",
            "rated": "200"
        },
        "enrolled": "35"
    },
    {
        "course_id": "4",
        "course_name": "Tailwind CSS : Beginner to Advanced 2022",
        "category_id": "4",
        "category_name": "Tailwind CSS",
        "price": "100",
        "details": "Hello and Welcome! I just showed you this sailing boat, because what I will teach you in this course will literally push forward your frontend development. Maybe you heard already that with TailwindCss you can develop beautiful and unique websites and interfaces very rapidly. But the most important advantage for me is, that you do not have to create endless stylesheets for adapting your website for different screen sizes. For example if you want to apply a class only for large screen sizes and above you just add a “lg:” to the class that you are using. My name is Martin and I've been using CSS and Frameworks like Bootstrap on a professional level for a very long time. I have to tell you - for me - TailwindCss is indeed a small revolution in web development. In Fact with TailwindCss you are combining the advantages of normal CSS with the advantages of frameworks like Bootstrap. In this course I will show you the Ins and Outs of how to install, configure and in many examples how to apply TailwindCss. We will do responsive Layouts, Animations and much more. Furthermore I will give you a short introduction into alpine.js, which is also revolutionary, when it comes to easily triggering behavior like animations in your web design. I will provide you with the full source code for every step we do in this course, as well as some useful cheat sheets - that will help you remember later what you learned. This course is not very long, I want to really urge you to invest a weekend or several evenings to do this course and to learn something, that is a lot of fun, and something that will definitely play a very important role in web development in the 2020’s. I look very much forward seeing you in this amazing course!",
        "thumbnail_img": "https://i.ibb.co/9tDg5X5/tailwind.jpg",
        "full_img": "https://i.ibb.co/M6vS0T0/tailwind.jpg",
        "instructor": {
            "name": "Code Bless You",
            "photo": "https://img-c.udemycdn.com/user/200_H/183495132_535a_3.jpg"
        },
        "ratings": {
            "rating": "4.8",
            "rated": "300"
        },
        "enrolled": "40"
    },
    {
        "course_id": "5",
        "course_name": "JavaScript from Beginner to Expert",
        "category_id": "5",
        "category_name": "JavaScript",
        "price": "150",
        "details": "Would you like to learn JavaScript and become a good earning front-end developer? Save your precious time by buying this course. You will learn how to program in JavaScript in a fast and easy way! The total length of the JavaScript course is over 12 hours! You will learn theory and you will also gain lots of practice. During the course, I will explain to you how to write real-life applications, like galleries with thumbnails, image sliders, etc. I will do everything so that you understand JavaScript. After this course, you will always understand the code you are writing. You will understand all concepts and create your own applications! After my course, you can become a front-end developer. JavaScript is a very demanded language by employers. The course is designed for people who don't have any knowledge about programming or want to truly understand JavaScript. It doesn't matter if you have never written any programs or you have no idea about programming... After my course, all this will change. You will bust the myth that programming is a difficult thing only for the few!",
        "thumbnail_img": "https://i.ibb.co/8rnPWYL/javascript.png",
        "full_img": "https://i.ibb.co/c6K2GYS/javascript.png",
        "instructor": {
            "name": "Arkadiusz Włodarczyk",
            "photo": "https://img-c.udemycdn.com/user/200_H/621716_0514_3.jpg"
        },
        "ratings": {
            "rating": "4.3",
            "rated": "1000"
        },
        "enrolled": "80"
    },
    {
        "course_id": "6",
        "course_name": "React Front To Back 2022",
        "category_id": "6",
        "category_name": "React",
        "price": "200",
        "details": "This course is for anyone that wants to learn React and also for React developers looking to build some projects and sharpen their skills. The first project (Feedback App) is structured in a way so I can explain the fundamentals such as components, hooks, props, state, etc in a way that beginners can understand. The second project (Github Finder) will show you how to work with 3rd party APIs and the third project (House Marketplace) is a larger app that uses Firebase 9 and includes authentication, Firestore queries, file storage and more. The final project has been added! It is a fullstack MERN support ticket system that uses Redux and Redux Toolkit.",
        "thumbnail_img": "https://i.ibb.co/jDQYXT9/react.jpg",
        "full_img": "https://i.ibb.co/fHyWw2V/react.jpg",
        "instructor": {
            "name": "Brad Traversy",
            "photo": "https://img-c.udemycdn.com/user/200_H/21681922_4513_5.jpg"
        },
        "ratings": {
            "rating": "4.5",
            "rated": "1020"
        },
        "enrolled": "230"
    }
]